app/services/authorize_api_request.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def user_from_token
    if headers["Authorization"].present?
      token = headers["Authorization"].split(" ").last
      decoded = decode_token(token)
      User.find(decoded[:user_id]) if decoded