app/validators/task_validator.rb

    task = Task.active.find_by(id: params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."deleted_at" IS NULL AND "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]