app/controllers/api/v1/tasks_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "tasks" ("title", "description", "status", "created_by", "deleted_by", "deleted_at", "created_at", "updated_at", "priority") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
      def create
        @task = Task.new(task_params)
        user = User.find(current_user.id)
        @task.created_by = user.name

        if @task.save

UPDATE "tasks" SET "updated_at" = $1, "priority" = $2 WHERE "tasks"."id" = $3  [["updated_at", "2024-10-28 17:02:19.658964"], ["priority", "Medium"], ["id", 17]]
---
      def update
        if @task.update(task_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "deleted_by" = $1, "deleted_at" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["deleted_by", "admin"], ["deleted_at", "2024-10-27 05:19:05.160418"], ["updated_at", "2024-10-27 05:19:05.161377"], ["id", 7]]
---
      def destroy
        # Soft delete
        user = User.find(current_user.id)
        if @task.update(deleted_at: Time.current, deleted_by: user.name)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
      def set_task
        @task = Task.find_by(id: params[:id])