app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def authenticate_request
    token = request.headers["Authorization"]&.split(" ")&.last
    if token
      begin
        @current_user = User.find(decode_token(token)[:user_id])