app/controllers/authentication_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "[FILTERED]"], ["LIMIT", 1]]
---
  def login
    begin
      validation_errors = UserValidator.validate_login_params(params)
      return render json: { errors: validation_errors }, status: :unprocessable_entity if validation_errors.any?

      user = User.find_for_database_authentication(email: params[:email])