app/controllers/tasks_controller.rb

  def index
    begin
      # Fetch active tasks with pagination
      @tasks = Task.active.page(params[:page]).per(params[:per_page] || 10)
---
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."deleted_at" IS NULL
SELECT "tasks".* FROM "tasks" WHERE "tasks"."deleted_at" IS NULL LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 0]]

  def show
    @task = Task.active.find_by(id: params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."deleted_at" IS NULL AND "tasks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def create
    @task = Task.new(task_params)
    user = User.find(current_user.id)
    @task.created_by = user.name

    if @task.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "tasks" ("title", "description", "status", "created_by", "deleted_by", "deleted_at", "created_at", "updated_at", "priority") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "tasks" ("title", "description", "status", "created_by", "deleted_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    if @task.update(task_params)
---
UPDATE "tasks" SET "deleted_by" = $1, "deleted_at" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["deleted_by", "admin"], ["deleted_at", "2024-10-23 02:54:08.157001"], ["updated_at", "2024-10-23 02:54:08.157939"], ["id", 1]]

  def destroy
    # Soft delete
    user = User.find(current_user.id)
    if @task.update(deleted_at: Time.current, deleted_by: user.name)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "deleted_by" = $1, "deleted_at" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["deleted_by", "admin"], ["deleted_at", "2024-10-23 20:37:10.945535"], ["updated_at", "2024-10-23 20:37:10.946062"], ["id", 2]]

  def set_task
    @task = Task.deleted.find_by(id: params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."deleted_at" IS NOT NULL AND "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]